# Setup

## imports

In [1]:
import pandas as pd
from datetime import datetime

## load data

In [2]:
customers = pd.read_csv("noahs-customers.csv")
items = pd.read_csv("noahs-orders_items.csv")
orders = pd.read_csv("noahs-orders.csv")
products = pd.read_csv("noahs-products.csv")

In [3]:
customers

,customerid,name,address,citystatezip,birthdate,phone
0,1001,Jack Quinn,201 E Park St,"Los Angeles, CA 91343",1960-05-14,805-287-8515
1,1002,David Powell,224C Tysens Ln,"Staten Island, NY 10306",1978-04-04,516-768-1652
2,1003,Carrie Green,1608 W 53rd Way,"Tampa, FL 33614",1969-01-21,727-209-0470
3,1004,Steven Miller,178½ E 7th St,"Manhattan, NY 10009",1953-08-17,607-941-9563
4,1005,Christine Powers,270 W 242nd St,"Bronx, NY 10463",1983-06-06,212-759-9043
...,...,...,...,...,...,...
11075,12075,Catherine Wells,693 E 101st St,"Brooklyn, NY 11236",1972-07-06,716-656-2836
11076,12076,Kevin Cooper,360 Edgecombe Ave,"Manhattan, NY 10031",1994-07-22,315-496-6981
11077,12077,Darius Johnson,2247 Grand Ave,"Bronx, NY 10453",1989-06-18,716-797-4450
11078,12078,Ryan Jones,1538 Park Pl SW,"Los Angeles, CA 90016",1949-03-12,415-584-2656
11079,12079,Gregory Weiss,113 Mackenzie St,"Brooklyn, NY 11235",1990-08-27,516-736-1869

In [4]:
items

        orderid      sku  qty  unit_price
0          1001  COL0820    1       25.52
1          1002  TOY8907    1       12.92
2          1002  KIT5813    1        7.99
3          1002  KIT3981    2        7.21
4          1003  KIT7098    1       12.53
...         ...      ...  ...         ...
427253   215206  KIT7684    1       13.94
427254   215206  KIT9250    1        3.99
427255   215206  HOM2099    1       91.85
427256   215207  PET0148    1        5.30
427257   215207  PET7876    1        5.74

[427258 rows x 4 columns]

In [5]:
orders

,orderid,customerid,ordered,shipped,items,total
0,1001,4308,2017-01-31 00:32:19,2017-01-31 07:15:00,NaN,25.52
1,1002,11683,2017-01-31 00:58:31,2017-01-31 18:00:00,NaN,35.33
2,1003,5676,2017-01-31 01:34:40,2017-01-31 09:00:00,NaN,30.79
3,1004,3097,2017-01-31 02:31:24,2017-01-31 19:45:00,NaN,77.60
4,1005,10374,2017-01-31 02:46:09,2017-01-31 14:45:00,NaN,109.04
...,...,...,...,...,...,...
214202,215203,2549,2022-12-16 20:58:55,2022-12-17 16:45:00,NaN,63.52
214203,215204,3343,2022-12-16 21:25:51,2022-12-16 21:25:51,NaN,43.35
214204,215205,3604,2022-12-16 21:28:40,2022-12-18 18:00:00,NaN,59.72
214205,215206,11486,2022-12-16 21:32:31,2022-12-18 08:30:00,NaN,109.78
214206,215207,3283,2022-12-16 22:33:53,2022-12-18 15:30:00,NaN,11.04

In [6]:
products

          sku                                         desc  wholesale_cost
0     DLI0002                    Smoked Whitefish Sandwich            9.33
1     PET0005             Vegan Cat Food, Turkey & Chicken            4.35
2     HOM0018                            Power Radio (red)           21.81
3     KIT0034                                  Azure Ladle            2.81
4     PET0041      Gluten-free Cat Food, Pumpkin & Pumpkin            4.60
...       ...                                          ...             ...
1119  TOY9939                      Transformers Board Game           17.54
1120  PET9974      Vegan Senior Cat Food, Salmon & Pumpkin            5.00
1121  PET9988  Gluten-free Senior Cat Food, Chicken & Beef            4.32
1122  HOM9988                       Mini Crockpot (purple)           59.93
1123  KIT9991                                Paper Spatula            0.81

[1124 rows x 3 columns]

# Puzzle

## 1. private investigator

In [7]:
name_phone = pd.DataFrame([customers["name"].apply(lambda x: x.split()[1]),
                           customers["phone"].apply(lambda x: x.replace("-", ""))]).T

In [8]:
name_phone = name_phone[name_phone["name"].str.len() == name_phone["phone"].str.len()]

In [9]:
keypad = {"2": ["A", "B", "C"],
          "3": ["D", "E", "F"],
          "4": ["G", "H", "I"],
          "5": ["J", "K", "L"],
          "6": ["M", "N", "O"],
          "7": ["P", "Q", "R", "S"],
          "8": ["T", "U", "V"],
          "9": ["W", "X", "Y", "Z"]}

In [10]:
keypad_reversed = {}

for key, values in keypad.items():
    for value in values:
        keypad_reversed[value] = key

In [30]:
def letters2nums(letters: str) -> str:
    """Iterates through a string of letters;
    returns a corresponding string of keypad numbers"""
    
    return "".join([keypad_reversed[letter]
                    for letter in letters.upper()])

In [31]:
name_phone["name_as_nums"] = name_phone["name"].apply(letters2nums)

In [32]:
investigator = name_phone[name_phone["phone"] == name_phone["name_as_nums"]]

In [33]:
investigator

            name       phone name_as_nums
2187  Guttenberg  4888362374   4888362374

In [34]:
customers.iloc[2187]

customerid                     3188
name                 Sam Guttenberg
address               221 Banker St
citystatezip     Brooklyn, NY 11222
birthdate       1998-05-30 00:00:00
phone                  488-836-2374
Name: 2187, dtype: object

## 2. contractor

In [16]:
customers_split = customers.copy(True)

In [17]:
customers_split["name_split"] = customers['name'].str.split()

In [18]:
customers_split = customers_split[customers_split["name_split"].str.len() == 2]

In [19]:
JD_in_NY = customers_split[(customers_split["name_split"].str[0].str[0] == "J") &
                           (customers_split["name_split"].str[1].str[0] == "D") &
                           (customers_split["citystatezip"].str.contains("NY"))]

In [20]:
JD_in_NY = JD_in_NY.join(orders.set_index('customerid'), on='customerid',
                         how='left')[["customerid", "name", "address", "citystatezip", "phone", "orderid"]]

In [21]:
JD_in_NY = JD_in_NY.join(items.set_index('orderid'), on='orderid',
                         how='left', lsuffix="orders", rsuffix="items")[["customerid", "name", "address", "citystatezip", "phone", "sku"]]

In [22]:
JD_in_NY = JD_in_NY.join(products.set_index('sku'), on='sku',
                         how='left', lsuffix="items", rsuffix="products")[["customerid", "name", "address", "citystatezip", "phone", "desc"]]

In [23]:
JD_in_NY = JD_in_NY.dropna(subset=["desc"])

In [24]:
JD_in_NY = JD_in_NY[(JD_in_NY["desc"].str.lower().str.contains("bagel")) |
                    (JD_in_NY["desc"].str.lower().str.contains("coffee"))]

In [25]:
desc = JD_in_NY.groupby(
    ["customerid", "name", "address", "citystatezip", "phone"])["desc"].sum()

In [26]:
desc[desc.str.lower().str.contains("bagel") &
     desc.str.lower().str.contains("coffee")]

customerid  name            address                   citystatezip                phone
1742        Jonathan Davis  862 Morris Park Ave       Bronx, NY 10462             585-510-8718                    Manual Coffee BowlCaraway Bagel
4164        Jeremy Davis    134-10 Foch Blvd          South Ozone Park, NY 11420  212-771-8924    Coffee, DripVintage Coffee StrainerSesame Bagel
5916        Joseph Davis    2385 Rear Cambreleng Ave  Bronx, NY 10458             585-645-6262             Mechanical Coffee SpatulaCaraway Bagel
Name: desc, dtype: object

## 3. Aries born in the year of the Dog

In [27]:
customers["birthdate"] = customers["birthdate"].astype(
    "datetime64[ns]")

In [29]:
customers[(customers["citystatezip"].str.contains("NY 11420")) &
          (customers["birthdate"].dt.year.isin([1934, 1946, 1958, 1970, 1982, 1994, 2006])) &
          (customers["birthdate"].dt.month.isin([3,4]))]

,customerid,name,address,citystatezip,birthdate,phone
1273,2274,Brent Nguyen,109-19 110th St,"South Ozone Park, NY 11420",1958-03-25,516-636-7397

## 4. bicycle fixer

In [ ]:
products["sku"].str[:3].unique()

In [ ]:
products[products["sku"].str.contains("BKY")]

In [ ]:
order_item_customer = orders.join(
    items, on="orderid", how="left", lsuffix="order", rsuffix="items").join(
        customers, on="customerid", how="left", lsuffix="left", rsuffix="customers")[
                    ["orderid", "customerid", "ordered", "sku", "name", "phone", "birthyear"]]

In [ ]:
order_item_customer["ordered"] = order_item_customer["ordered"].astype("datetime64[ns]")

In [ ]:
order_item_customer["ordered_hour"] = order_item_customer["ordered"].apply(lambda x: x.hour)

In [ ]:
pastry_b4_5_tinder_birthyear = order_item_customer[(order_item_customer["sku"].str.contains("BKY")) &
                    (order_item_customer["ordered_hour"] < 5) &
                    ((order_item_customer["birthyear"] < 1958+5) |
                     (order_item_customer["birthyear"] > 1958-5))]

In [ ]:
pastry_b4_5_tinder_birthyear[["customerid", "name", "phone", "ordered_hour"]]

In [ ]:
pastry_b4_5_tinder_birthyear[["customerid", "name", "phone", "ordered_hour"]
                             ].groupby(["customerid", "name", "phone"]
                                       ).count()